src/Documents/СопроводительныйДокумент/СопроводительныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СопроводительныйДокумент</name>
  <registerRecords>InformationRegister.Базар_СопроводительныеДокументы</registerRecords>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыСопроводительныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартыНаПродукцию</name>
    <attributes>
      <name>СтандартНаПродукцию</name>
      <type>
        <types>CatalogRef.СтандартыНаВыбработкуПродукции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Изображения</name>
    <attributes>
      <name>GUIDИзображения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Базар_СопроводительныеДокументы/Базар_СопроводительныеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Базар_СопроводительныеДокументы</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомуВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.Базар_ВидыСопроводительныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтандартНаПродукцию</name>
    <type>
      <types>CatalogRef.СтандартыНаВыбработкуПродукции</types>
    </type>
  </dimensions>
  <dimensions>
    <name>GUIDИзображения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Базар_ВидыСопроводительныхДокументов/Базар_ВидыСопроводительныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Базар_ВидыСопроводительныхДокументов</name>
  <enumValues>
    <name>ДекларацияСоответствия</name>
  </enumValues>
  <enumValues>
    <name>СертификатСоответствия</name>
  </enumValues>
  <enumValues>
    <name>КачественноеУдостоверение</name>
  </enumValues>
  <enumValues>
    <name>ПротоколЛабораторногоИсследования</name>
  </enumValues>
  <enumValues>
    <name>ИнформационноеПисьмо</name>
  </enumValues>
</mdclass:Enum>

src/Documents/СопроводительныйДокумент/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.КачественноеУдостоверение") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию.СтандартНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("КемВыдан");
		МассивНепроверяемыхРеквизитов.Добавить("КомуВыдан");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ПротоколЛабораторногоИсследования") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию.СтандартНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДействия");
	ИначеЕсли ВидОперации = ПредопределенноеЗначение("Перечисление.Базар_ВидыСопроводительныхДокументов.ИнформационноеПисьмо") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("СтандартыНаПродукцию.СтандартНаПродукцию");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДействия");
		МассивНепроверяемыхРеквизитов.Добавить("КемВыдан");
	КонецЕсли;
	
	// Проверка значения реквизита ДатаОкончанияДействия
	Если МассивНепроверяемыхРеквизитов.Найти("ДатаОкончанияДействия") = Неопределено тогда
		Если Дата > ДатаОкончанияДействия Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Срок действия документа не должен быть меньше чем дата документа!'");
			Сообщение.Поле = "ДатаОкончанияДействия";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина; 
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДействия"); 
		КонецЕсли;
	КонецЕсли;
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Базар_СопроводительныеДокументы.Записывать = Истина;
	Движения.Базар_СопроводительныеДокументы.Очистить();
	
	Если ВидОперации = Перечисления.Базар_ВидыСопроводительныхДокументов.КачественноеУдостоверение
	 ИЛИ ВидОперации = Перечисления.Базар_ВидыСопроводительныхДокументов.ПротоколЛабораторногоИсследования
	 ИЛИ ВидОперации = Перечисления.Базар_ВидыСопроводительныхДокументов.ИнформационноеПисьмо тогда
		Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
			Для Каждого ТекСтрокаИзображение из Изображения цикл
				ЗаписатьДвижение(ТекСтрокаНоменклатура, ТекСтрокаИзображение);
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрокаНоменклатура Из Номенклатура Цикл
			Для Каждого ТекСтрокаСтандартыНаПродукцию Из СтандартыНаПродукцию Цикл
				Для Каждого ТекСтрокаИзображение из Изображения цикл
					ЗаписатьДвижение(ТекСтрокаНоменклатура, ТекСтрокаИзображение, ТекСтрокаСтандартыНаПродукцию);
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьДвижение(СтрокаНоменклатура, СтрокаИзображение, СтрокаСтандартыНаПродукцию = Неопределено)
	
	Движение = Движения.Базар_СопроводительныеДокументы.Добавить();
	Движение.НомерДокумента        = НомерДокумента;
	Движение.ВидОперации           = ВидОперации;
	Движение.ДатаОкончанияДействия = КонецДня(ДатаОкончанияДействия);
	Движение.Номенклатура          = СтрокаНоменклатура.Номенклатура;
	
	Если ЗначениеЗаполнено(СтрокаСтандартыНаПродукцию) тогда
		Движение.СтандартНаПродукцию   = СтрокаСтандартыНаПродукцию.СтандартНаПродукцию;
	КонецЕсли;
	
	Движение.GUIDИзображения       = СтрокаИзображение.GUIDИзображения;
	Движение.КемВыдан              = КемВыдан;
	Движение.КомуВыдан             = КомуВыдан;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
	Изображения.Очистить();
	НомерДокумента = "";
	ДатаОкончанияДействия = "";
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ДанныеЗаполнения.Свойство("Номенклатура") тогда
		НоваяСтрока = Номенклатура.Добавить();
		НоваяСтрока.Номенклатура = ДанныеЗаполнения.Номенклатура;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Дата = НачалоДня(Дата);
	
КонецПроцедуры
